Tekla.Structures.Analysis.AnalysisNode
The AnalysisNode class contains information related to analysis nodes.

Tekla.Structures.Analysis.AnalysisNode._CoordinateSystem
The coordinate system of the analysis node.

Tekla.Structures.Analysis.AnalysisNode._Label
The label of the analysis node.

Tekla.Structures.Analysis.AnalysisNode._Position
The position of the analysis node.

Tekla.Structures.Analysis.AnalysisNode._Support
The support of the analysis node.

Tekla.Structures.Analysis.AnalysisNode._IsUserNode
This indicates whether the analysis node is a user node.

Tekla.Structures.Analysis.AnalysisNode._IsUserSupport
This indicates whether the analysis node ha a user node.

Tekla.Structures.Analysis.AnalysisNode.CoordinateSystem
The coordinate system of the analysis node.

Tekla.Structures.Analysis.AnalysisNode.IsUserNode
Indicates whether the analysis node is a user node.

Tekla.Structures.Analysis.AnalysisNode.IsUserSupport
Indicates whether the analysis node has a user node.

Tekla.Structures.Analysis.AnalysisNode.Label
The label of the analysis node.

Tekla.Structures.Analysis.AnalysisNode.Position
The position of the analysis node (in the global coordinate system).

Tekla.Structures.Analysis.AnalysisNode.Support
The support of the analysis node.

Tekla.Structures.Analysis.AnalysisNode.Insert
Inserts an analysis node.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisNode.Select
Selects an analysis node.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisNode.Modify
Modifies an analysis node.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisNode.Delete
Deletes an analysis node.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisNode.GetAnalysisParts
Get analysis parts connected to node.
Returns: Enumerator of analysis parts connected to node.

Tekla.Structures.Analysis.AnalysisNode.GetAnalysisNodeLinks
Get analysis nodelinks connected to node.
Returns: Enumerator of analysis nodelinks connected to node.

Tekla.Structures.Analysis.AnalysisNode.InsertInstance


Tekla.Structures.Analysis.AnalysisNode.SelectInstance


Tekla.Structures.Analysis.AnalysisNode.ModifyInstance


Tekla.Structures.Analysis.AnalysisNode.DeleteInstance
